perf/results/single-node/breakpoint/heavy/run.log

> perf@1.0.0 artillery /home/guidobotta/dev/arquitectura/tp1/perf
> NODE_OPTIONS=--max-old-space-size=4096 artillery "run" "./results/single-node/breakpoint/cfg-breakpoint-heavy.yaml" "-e" "heavy"

Phase started: Slow Ramp (index: 0, duration: 300s) 18:20:54(-0300)

--------------------------------------
Metrics for period to: 18:21:00(-0300) (width: 5.019s)
--------------------------------------

http.codes.200: ................................................................ 1
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 5
http.response_time:
  min: ......................................................................... 5006
  max: ......................................................................... 5006
  median: ...................................................................... 4965.3
  p95: ......................................................................... 4965.3
  p99: ......................................................................... 4965.3
http.responses: ................................................................ 1
vusers.completed: .............................................................. 1
vusers.created: ................................................................ 5
vusers.created_by_name.Root (/): ............................................... 5
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 5018.7
  max: ......................................................................... 5018.7
  median: ...................................................................... 5065.6
  p95: ......................................................................... 5065.6
  p99: ......................................................................... 5065.6


--------------------------------------
Metrics for period to: 18:21:10(-0300) (width: 9.501s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 3
http.codes.200: ................................................................ 1
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 9
http.response_time:
  min: ......................................................................... 8521
  max: ......................................................................... 8521
  median: ...................................................................... 8520.7
  p95: ......................................................................... 8520.7
  p99: ......................................................................... 8520.7
http.responses: ................................................................ 1
vusers.completed: .............................................................. 1
vusers.created: ................................................................ 9
vusers.created_by_name.Root (/): ............................................... 9
vusers.failed: ................................................................. 3
vusers.session_length:
  min: ......................................................................... 8523.1
  max: ......................................................................... 8523.1
  median: ...................................................................... 8520.7
  p95: ......................................................................... 8520.7
  p99: ......................................................................... 8520.7


--------------------------------------
Metrics for period to: 18:21:20(-0300) (width: 9.499s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 9
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 8
vusers.created: ................................................................ 8
vusers.created_by_name.Root (/): ............................................... 8
vusers.failed: ................................................................. 9


--------------------------------------
Metrics for period to: 18:21:30(-0300) (width: 9.501s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 8
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 10
vusers.created: ................................................................ 10
vusers.created_by_name.Root (/): ............................................... 10
vusers.failed: ................................................................. 8


--------------------------------------
Metrics for period to: 18:21:40(-0300) (width: 9.5s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 10
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 10
vusers.created: ................................................................ 10
vusers.created_by_name.Root (/): ............................................... 10
vusers.failed: ................................................................. 10


--------------------------------------
Metrics for period to: 18:21:50(-0300) (width: 9.501s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 10
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 11
vusers.created: ................................................................ 11
vusers.created_by_name.Root (/): ............................................... 11
vusers.failed: ................................................................. 10


--------------------------------------
Metrics for period to: 18:22:00(-0300) (width: 9.499s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 11
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 14
vusers.created: ................................................................ 14
vusers.created_by_name.Root (/): ............................................... 14
vusers.failed: ................................................................. 11


--------------------------------------
Metrics for period to: 18:22:10(-0300) (width: 8.999s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 14
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 9
vusers.created: ................................................................ 9
vusers.created_by_name.Root (/): ............................................... 9
vusers.failed: ................................................................. 14


--------------------------------------
Metrics for period to: 18:22:20(-0300) (width: 9.502s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 9
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 12
vusers.created: ................................................................ 12
vusers.created_by_name.Root (/): ............................................... 12
vusers.failed: ................................................................. 9


--------------------------------------
Metrics for period to: 18:22:30(-0300) (width: 9s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 12
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 9
vusers.created: ................................................................ 9
vusers.created_by_name.Root (/): ............................................... 9
vusers.failed: ................................................................. 12


--------------------------------------
Metrics for period to: 18:22:40(-0300) (width: 8s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 9
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 10
vusers.created: ................................................................ 10
vusers.created_by_name.Root (/): ............................................... 10
vusers.failed: ................................................................. 9


--------------------------------------
Metrics for period to: 18:22:50(-0300) (width: 9.501s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 10
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 9
vusers.created: ................................................................ 9
vusers.created_by_name.Root (/): ............................................... 9
vusers.failed: ................................................................. 10


--------------------------------------
Metrics for period to: 18:23:00(-0300) (width: 9.5s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 9
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 13
vusers.created: ................................................................ 13
vusers.created_by_name.Root (/): ............................................... 13
vusers.failed: ................................................................. 9


--------------------------------------
Metrics for period to: 18:23:10(-0300) (width: 9s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 13
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 13
vusers.created: ................................................................ 13
vusers.created_by_name.Root (/): ............................................... 13
vusers.failed: ................................................................. 13


--------------------------------------
Metrics for period to: 18:23:20(-0300) (width: 8s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 13
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 11
vusers.created: ................................................................ 11
vusers.created_by_name.Root (/): ............................................... 11
vusers.failed: ................................................................. 13


--------------------------------------
Metrics for period to: 18:23:30(-0300) (width: 8.501s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 11
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 16
vusers.created: ................................................................ 16
vusers.created_by_name.Root (/): ............................................... 16
vusers.failed: ................................................................. 11


--------------------------------------
Metrics for period to: 18:23:40(-0300) (width: 9.501s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 16
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.Root (/): ............................................... 20
vusers.failed: ................................................................. 16


--------------------------------------
Metrics for period to: 18:23:50(-0300) (width: 9.503s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 20
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.Root (/): ............................................... 20
vusers.failed: ................................................................. 20


--------------------------------------
Metrics for period to: 18:24:00(-0300) (width: 9.502s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 20
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.Root (/): ............................................... 20
vusers.failed: ................................................................. 20


--------------------------------------
Metrics for period to: 18:24:10(-0300) (width: 9.501s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 20
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.Root (/): ............................................... 20
vusers.failed: ................................................................. 20


--------------------------------------
Metrics for period to: 18:24:20(-0300) (width: 9.502s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 20
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.Root (/): ............................................... 20
vusers.failed: ................................................................. 20


--------------------------------------
Metrics for period to: 18:24:30(-0300) (width: 9.502s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 20
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.Root (/): ............................................... 20
vusers.failed: ................................................................. 20


--------------------------------------
Metrics for period to: 18:24:40(-0300) (width: 9.501s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 20
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.Root (/): ............................................... 20
vusers.failed: ................................................................. 20


--------------------------------------
Metrics for period to: 18:24:50(-0300) (width: 9.501s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 20
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.Root (/): ............................................... 20
vusers.failed: ................................................................. 20


--------------------------------------
Metrics for period to: 18:25:00(-0300) (width: 9.501s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 20
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.Root (/): ............................................... 20
vusers.failed: ................................................................. 20


--------------------------------------
Metrics for period to: 18:25:10(-0300) (width: 9.501s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 20
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.Root (/): ............................................... 20
vusers.failed: ................................................................. 20


--------------------------------------
Metrics for period to: 18:25:20(-0300) (width: 9.501s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 20
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.Root (/): ............................................... 20
vusers.failed: ................................................................. 20


--------------------------------------
Metrics for period to: 18:25:30(-0300) (width: 9.501s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 20
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.Root (/): ............................................... 20
vusers.failed: ................................................................. 20


--------------------------------------
Metrics for period to: 18:25:40(-0300) (width: 9.501s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 20
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.Root (/): ............................................... 20
vusers.failed: ................................................................. 20


Phase completed: Slow Ramp (index: 0, duration: 300s) 18:25:55(-0300)

Phase started: Reset Line (index: 1, duration: 30s) 18:25:55(-0300)

--------------------------------------
Metrics for period to: 18:25:50(-0300) (width: 9.501s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 20
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.Root (/): ............................................... 20
vusers.failed: ................................................................. 20


--------------------------------------
Metrics for period to: 18:26:00(-0300) (width: 9.5s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 20
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 14
vusers.created: ................................................................ 14
vusers.created_by_name.Root (/): ............................................... 14
vusers.failed: ................................................................. 20


--------------------------------------
Metrics for period to: 18:26:10(-0300) (width: 9s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 14
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 10
vusers.created: ................................................................ 10
vusers.created_by_name.Root (/): ............................................... 10
vusers.failed: ................................................................. 14


Phase completed: Reset Line (index: 1, duration: 30s) 18:26:25(-0300)

--------------------------------------
Metrics for period to: 18:26:20(-0300) (width: 9s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 10
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 10
vusers.created: ................................................................ 10
vusers.created_by_name.Root (/): ............................................... 10
vusers.failed: ................................................................. 10


--------------------------------------
Metrics for period to: 18:26:30(-0300) (width: 9.001s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 10
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 6
vusers.created: ................................................................ 6
vusers.created_by_name.Root (/): ............................................... 6
vusers.failed: ................................................................. 10


--------------------------------------
Metrics for period to: 18:26:40(-0300) (width: 5s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 6
vusers.failed: ................................................................. 6


All VUs finished. Total time: 5 minutes, 41 seconds

--------------------------------
Summary report @ 18:26:35(-0300)
--------------------------------

errors.ETIMEDOUT: .............................................................. 487
http.codes.200: ................................................................ 2
http.request_rate: ............................................................. 1/sec
http.requests: ................................................................. 489
http.response_time:
  min: ......................................................................... 5006
  max: ......................................................................... 8521
  median: ...................................................................... 4965.3
  p95: ......................................................................... 4965.3
  p99: ......................................................................... 4965.3
http.responses: ................................................................ 2
vusers.completed: .............................................................. 2
vusers.created: ................................................................ 489
vusers.created_by_name.Root (/): ............................................... 489
vusers.failed: ................................................................. 487
vusers.session_length:
  min: ......................................................................... 5018.7
  max: ......................................................................... 8523.1
  median: ...................................................................... 5065.6
  p95: ......................................................................... 5065.6
  p99: ......................................................................... 5065.6